nozzle_extended_00/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "side.*"
    {
        type            noSlip;
    }

    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate 3.0e-6;
    }

    outlet
    {
        type            zeroGradient;
    }

    "processor.*"
    {
        type  processor;
    }
}


// ************************************************************************* //
